Revit 2027 API
BuiltInFailures.MEPSupportFailures Class
 Failures about MEP suppor.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class MEPSupportFailures
Public NotInheritable Class MEPSupportFailures
public ref class MEPSupportFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MEPSupportFailures = class end
The BuiltInFailures.MEPSupportFailures type exposes the following members.
Properties
Name | Description
CannotMatchInstanceSizeToHostError |  The instance of [Symbol] cannot be re-sized to match the host.
InstanceOutOfHostError |  The instance of [Symbol] lost its host and will be deleted.
InstanceProfileNotMatchWithHostError |  The [Symbol]'s profile does not match the host. Instances of [Symbol] will be deleted.
TypeSizeNotMatchWithHostError |  The [Symbol] does not match the size of the host.
Top
See Also
Reference
Autodesk.Revit.DB Namespace